Проект22/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Роли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Проект22/Catalogs/Пользователи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    Запрос=Новый Запрос;
    Запрос.Текст= "ВЫБРАТЬ
                  |    Пользователи.Логин КАК Логин,
                  |    Пользователи.УникальныйИдентификатор КАК УникальныйИдентификатор
                  |ИЗ
                  |    Справочник.Пользователи КАК Пользователи
                  |ГДЕ
                  |    Пользователи.Логин = &Логин";     
    
    Запрос.УстановитьПараметр("Логин", Объект.Логин);
    Результат=Запрос.Выполнить().Выбрать();
    Если Результат.Следующий() Тогда    
        //Если одна и та же запись справочника, то условие будет истинно. Если нет пользователей с таким логином, то условие будет истинно.
        Если Результат.Количество()= 0 ИЛИ ТекущийОбъект.УникальныйИдентификатор = Результат.УникальныйИдентификатор Тогда  
            //Нахождение пользователя в списке пользователей информационной базы через уникальный идентификатор
            ПользовательСсылка=ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.УникальныйИдентификатор);
            
            //Если пользователь не найден, то создается новый
            
            //Присмечание: Если значение не найдено
            //то для пользователя с административными правами возвращается значение Неопределено,
            //для других пользователей вызывается исключение
            Если ПользовательСсылка=Неопределено тогда 
                
                НовыйПользователь=ПользователиИнформационнойБазы.СоздатьПользователя();
                НовыйПользователь.Имя = Объект.Логин;  
                НовыйПользователь.Пароль = Объект.Пароль;
                НовыйПользователь.ПолноеИмя = Объект.Наименование;
                Если объект.Роль=Перечисления.Роли.Администратор Тогда
                    НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);      
                ИначеЕсли объект.Роль=Перечисления.Роли.Менеджер Тогда
                    НовыйПользователь.Роли.Добавить(Метаданные.Роли.Менеджер);
                ИначеЕсли объект.Роль=Перечисления.Роли.Мастер Тогда
                    НовыйПользователь.Роли.Добавить(Метаданные.Роли.Мастер);
                ИначеЕсли объект.Роль=Перечисления.Роли.Замерщик Тогда
                    НовыйПользователь.Роли.Добавить(Метаданные.Роли.Замерщик); 
                ИначеЕсли объект.Роль=Перечисления.Роли.Директор Тогда
                    НовыйПользователь.Роли.Добавить(Метаданные.Роли.Директор);
                КонецЕсли;
                НовыйПользователь.ПоказыватьВСпискеВыбора=Ложь;
                
                //Уникальный идентификатор у пользователя ИБ неявно создается после записи.
                НовыйПользователь.Записать();
                ТекущийОбъект.УникальныйИдентификатор=НовыйПользователь.УникальныйИдентификатор;
                Иначе
                ПользовательСсылка.Пароль=Объект.Пароль; 
                ПользовательСсылка.ПолноеИмя=Объект.Наименование;
                ПользовательСсылка.Роли.Очистить();    
                Если объект.Роль=Перечисления.Роли.Администратор Тогда
                    ПользовательСсылка.Роли.Добавить(Метаданные.Роли.Администратор);      
                ИначеЕсли объект.Роль=Перечисления.Роли.Менеджер Тогда
                    ПользовательСсылка.Роли.Добавить(Метаданные.Роли.Менеджер);
                ИначеЕсли объект.Роль=Перечисления.Роли.Мастер Тогда
                    НовыйПользователь.Роли.Добавить(Метаданные.Роли.Мастер);
                ИначеЕсли объект.Роль=Перечисления.Роли.Замерщик Тогда
                    НовыйПользователь.Роли.Добавить(Метаданные.Роли.Замерщик); 
                ИначеЕсли объект.Роль=Перечисления.Роли.Директор Тогда
                    НовыйПользователь.Роли.Добавить(Метаданные.Роли.Директор);
                КонецЕсли;
                ПользовательСсылка.Записать();
            КонецЕсли;
        Иначе
            Сообщ=Новый СообщениеПользователю;
            Сообщ.Текст="Пользователь с таким логином уже существует!";
            Сообщ.Сообщить();
            Отказ=Истина;
        КонецЕсли
    Иначе
        НовыйПользователь=ПользователиИнформационнойБазы.СоздатьПользователя();
        НовыйПользователь.Имя=Объект.Логин;
        НовыйПользователь.Пароль=Объект.Пароль;
        НовыйПользователь.ПолноеИмя=Объект.Наименование; 
        Если объект.Роль=Перечисления.Роли.Администратор Тогда
            НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);      
        ИначеЕсли объект.Роль=Перечисления.Роли.Менеджер Тогда
            НовыйПользователь.Роли.Добавить(Метаданные.Роли.Менеджер);
        ИначеЕсли объект.Роль=Перечисления.Роли.Мастер Тогда
            НовыйПользователь.Роли.Добавить(Метаданные.Роли.Мастер);
        ИначеЕсли объект.Роль=Перечисления.Роли.Замерщик Тогда
            НовыйПользователь.Роли.Добавить(Метаданные.Роли.Замерщик); 
        ИначеЕсли объект.Роль=Перечисления.Роли.Директор Тогда
            НовыйПользователь.Роли.Добавить(Метаданные.Роли.Директор);
        КонецЕсли;
        НовыйПользователь.ПоказыватьВСпискеВыбора=Ложь;
            
        //Уникальный идентификатор пользователя ИБ неявно создается после записи
        НовыйПользователь.Записать();
        ТекущийОбъект.УникальныйИдентификатор=НовыйПользователь.УникальныйИдентификатор;
    КонецЕсли;
        
КонецПроцедуры
